server/test/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 20
      rampTo: 100
      name: 'Ramp up'
    - duration: 60
      arrivalRate: 100
      name: 'Peak'
  environments:
    production:
      target: 'https://api.spark-lms.com'
scenarios:
  - name: 'Student browsing course data'
    flow:
      - get:
          url: '/api/courses'
          headers:
            Authorization: 'Bearer TEST_TOKEN_PLACEHOLDER'
      - think: 2
      - get:
          url: '/api/tasks/course/test-course-id'
          headers:
            Authorization: 'Bearer TEST_TOKEN_PLACEHOLDER'
      - think: 2
      - get:
          url: '/api/tests/course/test-course-id'
          headers:
            Authorization: 'Bearer TEST_TOKEN_PLACEHOLDER'